openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Can.c
// Message box status defines
#define MB_TX_ONCE		0xc
#define MB_INACTIVE	0x8
#define MB_RX				0x4
#define MB_ABORT			0x9

//-------------------------------------------------------------------
typedef enum
{
  CAN_UNINIT = 0,
  CAN_READY
} Can_DriverStateType;

typedef union {
    vuint32_t R;
    struct {
        vuint32_t:14;
        vuint32_t TWRNINT:1;
        vuint32_t RWRNINT:1;
        vuint32_t BIT1ERR:1;
        vuint32_t BIT0ERR:1;
        vuint32_t ACKERR:1;
        vuint32_t CRCERR:1;
        vuint32_t FRMERR:1;
        vuint32_t STFERR:1;
        vuint32_t TXWRN:1;
        vuint32_t RXWRN:1;
        vuint32_t IDLE:1;
        vuint32_t TXRX:1;
        vuint32_t FLTCONF:2;
          vuint32_t:1;
        vuint32_t BOFFINT:1;
        vuint32_t ERRINT:1;
        vuint32_t WAKINT:1;
    } B;
} ESRType;                  /* Error and Status Register */

#if defined(CFG_MPC5567)
typedef struct FLEXCAN2_tag flexcan_t;
#else
typedef struct FLEXCAN_tag flexcan_t;
#endif

// Mapping between HRH and Controller//HOH
typedef struct Can_Arc_ObjectHOHMapStruct
{
  uint32 HxHRef;    // Reference to HRH or HTH
  CanControllerIdType CanControllerRef;    // Reference to controller
  const Can_HardwareObjectType* CanHOHRef;       // Reference to HOH.
} Can_Arc_ObjectHOHMapType;

/* Type for holding global information used by the driver */
typedef struct {
  Can_DriverStateType initRun;

  // Our config
  const Can_ConfigType *config;

  // One bit for each channel that is configured.
  // Used to determine if validity of a channel
  // 1 - configured
  // 0 - NOT configured
  uint32  configured;
  // Maps the a channel id to a configured channel id
  uint8   channelMap[CAN_CONTROLLER_CNT];

  // This is a map that maps the HTH:s with the controller and Hoh. It is built
  // during Can_Init and is used to make things faster during a transmit.
  Can_Arc_ObjectHOHMapType CanHTHMap[NUM_OF_HTHS];
} Can_GlobalType;

// Global config
Can_GlobalType Can_Global =
{
    .initRun = CAN_UNINIT,
};


/* Type for holding information about each controller */
typedef struct {
  CanIf_ControllerModeType state;
  uint32		lock_cnt;
  // Interrupt masks that is for all Mb's in this controller
  uint32 		Can_Arc_RxMbMask;
  uint32 		Can_Arc_TxMbMask;


  // Statistics
  Can_Arc_StatisticsType stats;
  uint32_t mbTxFree;

  // Data stored for Txconfirmation callbacks to CanIf
  PduIdType swPduHandles[MAX_NUM_OF_MAILBOXES];

} Can_UnitType;


Can_UnitType CanUnit[CAN_CONTROLLER_CNT] =
{
  {
    .state = CANIF_CS_UNINIT,
  },{
    .state = CANIF_CS_UNINIT,
  },
#if defined(CFG_MPC5516) || defined(CFG_MPC5517) ||  defined(CFG_MPC5567)
  {
    .state = CANIF_CS_UNINIT,
  },{
    .state = CANIF_CS_UNINIT,
  },{
    .state = CANIF_CS_UNINIT,
  },
#endif
#if defined(CFG_MPC5516) || defined(CFG_MPC5517)
  {
    .state = CANIF_CS_UNINIT,
  }
#endif
};


//-------------------------------------------------------------------

//-------------------------------------------------------------------
/**
 * Function that finds the Hoh( HardwareObjectHandle ) from a Hth
 * A HTH may connect to one or several HOH's. Just find the first one.
 *
 * @param hth The transmit handle
 * @returns Ptr to the Hoh
 */
static const Can_HardwareObjectType * Can_FindHoh( Can_Arc_HTHType hth , uint32* controller)
{
  const Can_HardwareObjectType *hohObj;
  const Can_Arc_ObjectHOHMapType *map;
  const Can_ControllerConfigType *canHwConfig;

  map = &Can_Global.CanHTHMap[hth];

  // Verify that this is the correct map
  if (map->HxHRef != hth)
  {
    DET_REPORTERROR(MODULE_ID_CAN, 0, 0x6, CAN_E_PARAM_HANDLE);
  }

  canHwConfig= GET_CONTROLLER_CONFIG(Can_Global.channelMap[map->CanControllerRef]);

  hohObj = map->CanHOHRef;

  // Verify that this is the correct Hoh type
  if ( hohObj->CanObjectType == CAN_OBJECT_TYPE_TRANSMIT)
  {
    *controller = map->CanControllerRef;
    return hohObj;
  }

  DET_REPORTERROR(MODULE_ID_CAN, 0, 0x6, CAN_E_PARAM_HANDLE);

  return NULL;
}

//-------------------------------------------------------------------

static void Can_Isr( int unit );
static void Can_Err( int unit );
static void Can_BusOff( int unit );

void Can_A_Isr( void  ) {	Can_Isr(CAN_CTRL_A); }
void Can_B_Isr( void  ) {	Can_Isr(CAN_CTRL_B); }
#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5567)
void Can_C_Isr( void  ) {	Can_Isr(CAN_CTRL_C); }
void Can_D_Isr( void  ) {	Can_Isr(CAN_CTRL_D); }
void Can_E_Isr( void  ) {	Can_Isr(CAN_CTRL_E); }
#endif
#if defined(CFG_MPC5516) || defined(CFG_MPC5517)
void Can_F_Isr( void  ) {	Can_Isr(CAN_CTRL_F); }
#endif

void Can_A_Err( void  ) {	Can_Err(CAN_CTRL_A); }
void Can_B_Err( void  ) {	Can_Err(CAN_CTRL_B); }
#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5567)
void Can_C_Err( void  ) {	Can_Err(CAN_CTRL_C); }
void Can_D_Err( void  ) {	Can_Err(CAN_CTRL_D); }
void Can_E_Err( void  ) {	Can_Err(CAN_CTRL_E); }
#endif
#if defined(CFG_MPC5516) || defined(CFG_MPC5517)
void Can_F_Err( void  ) {	Can_Err(CAN_CTRL_F); }
#endif

void Can_A_BusOff( void  ) {	Can_BusOff(CAN_CTRL_A); }
void Can_B_BusOff( void  ) {	Can_BusOff(CAN_CTRL_B); }
#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5567)
void Can_C_BusOff( void  ) {	Can_BusOff(CAN_CTRL_C); }
void Can_D_BusOff( void  ) {	Can_BusOff(CAN_CTRL_D); }
void Can_E_BusOff( void  ) {	Can_BusOff(CAN_CTRL_E); }
#endif
#if defined(CFG_MPC5516) || defined(CFG_MPC5517)
void Can_F_BusOff( void  ) {	Can_BusOff(CAN_CTRL_F); }
#endif
//-------------------------------------------------------------------

// Uses 25.4.5.1 Transmission Abort Mechanism
static void Can_AbortTx( flexcan_t *canHw, Can_UnitType *canUnit ) {
  uint32 mbMask;
  uint8 mbNr;

	// Find our Tx boxes.
  mbMask = canUnit->Can_Arc_TxMbMask;

  // Loop over the Mb's set to abort
  for (; mbMask; mbMask&=~(1<<mbNr)) {
    mbNr = ilog2(mbMask);

