openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Can.c
    canHw->BUF[mbNr].CS.B.CODE = MB_ABORT;

    // Did it take
    if( canHw->BUF[mbNr].CS.B.CODE != MB_ABORT ) {
			// nope..

    	// it's not sent... or being sent.
    	// Just wait for it
      int i = 0;
    	while( canHw->IFRL.R == (1<<mbNr) )
    	{
    	  i++;
    	  if (i > 1000)
    	    break;
    	}
    }
  }

  // Ack tx interrupts
  canHw->IFRL.R = canUnit->Can_Arc_TxMbMask;
  canUnit->mbTxFree = canUnit->Can_Arc_TxMbMask;
}

/**
 * Hardware error ISR for CAN
 *
 * @param unit CAN controller number( from 0 )
 */

static void Can_Err( int unit ) {
  flexcan_t *canHw = GET_CONTROLLER(unit);
  Can_UnitType *canUnit = GET_PRIVATE_DATA(unit);
  Can_Arc_ErrorType err;
  ESRType esr;
  err.R = 0;

  esr.R = canHw->ESR.R;

  err.B.ACKERR = esr.B.ACKERR;
  err.B.BIT0ERR = esr.B.BIT0ERR;
  err.B.BIT1ERR = esr.B.BIT1ERR;
  err.B.CRCERR = esr.B.CRCERR;
  err.B.FRMERR = esr.B.FRMERR;
  err.B.STFERR = esr.B.STFERR;
  err.B.RXWRN = esr.B.RXWRN;
  err.B.TXWRN = esr.B.TXWRN;

  if (GET_CALLBACKS()->Arc_Error != NULL)
  {
    GET_CALLBACKS()->Arc_Error(unit, err );
  }

  // Do same handling as within BUS_OFF even though no real AR req
  Can_SetControllerMode(unit, CAN_T_STOP); // CANIF272
  Can_AbortTx( canHw, canUnit ); // CANIF273

  // Clear ERRINT
  canHw->ESR.B.ERRINT = 1;
}

//-------------------------------------------------------------------

/**
 * BussOff ISR for CAN
 *
 * @param unit CAN controller number( from 0 )
 */
static void Can_BusOff( int unit ) {
  flexcan_t *canHw = GET_CONTROLLER(unit);
  Can_UnitType *canUnit = GET_PRIVATE_DATA(unit);
  Can_Arc_ErrorType err;
  err.R = 0;

  if ( canHw->ESR.B.TWRNINT )
  {
    err.B.TXWRN = canHw->ESR.B.TXWRN;
    canUnit->stats.txErrorCnt++;
    canHw->ESR.B.TWRNINT = 1;
  }

  if ( canHw->ESR.B.RWRNINT )
  {
    err.B.RXWRN = canHw->ESR.B.RXWRN;
    canUnit->stats.rxErrorCnt++;
    canHw->ESR.B.RWRNINT = 1;
  }

  if (err.R != 0)
  {
    if (GET_CALLBACKS()->Arc_Error != NULL)
    {
      GET_CALLBACKS()->Arc_Error( unit, err );
    }
  }

  if( canHw->ESR.B.BOFFINT ) {

    canUnit->stats.boffCnt++;
    if (GET_CALLBACKS()->ControllerBusOff != NULL)
    {
      GET_CALLBACKS()->ControllerBusOff(unit);
    }
    Can_SetControllerMode(unit, CAN_T_STOP); // CANIF272

    canHw->ESR.B.BOFFINT = 1;

    Can_AbortTx( canHw, canUnit ); // CANIF273
  }
}

//-------------------------------------------------------------------

/**
 * ISR for CAN. Normal Rx/Tx operation
 *
 * @param unit CAN controller number( from 0 )
 */
static void Can_Isr(int unit)
{

    flexcan_t *canHw = GET_CONTROLLER(unit);
    const Can_ControllerConfigType *canHwConfig =
            GET_CONTROLLER_CONFIG(Can_Global.channelMap[unit]);
    uint32 iFlagLow = canHw->IFRL.R;
    Can_UnitType *canUnit = GET_PRIVATE_DATA(unit);

    // Read interrupt flags to seeTxConfirmation what interrupt triggered the interrupt
    if ( (iFlagLow & canHw->IMRL.R) == 0) {
        assert(0);
        // Other reasons that we end up here
        // - Interupt on a masked box
    } else {

        // No FIFO used
        const Can_HardwareObjectType *hohObj;
        uint32 mbMask;
        uint8 mbNr = 0;
        uint32 data;
        Can_IdType id;


        //
        // Loop over all the Hoh's
        //

        // Rx
        hohObj = canHwConfig->Can_Arc_Hoh;
        --hohObj;
        do {
            ++hohObj;

            mbMask = hohObj->Can_Arc_MbMask & iFlagLow;

            if (hohObj->CanObjectType == CAN_OBJECT_TYPE_RECEIVE) {
                // Loop over the Mb's for this Hoh
                for (; mbMask; mbMask &= ~(1 << mbNr)) {
                    mbNr = ilog2(mbMask);

                    // Do the necessary dummy reads to keep controller happy
                    data = canHw->BUF[mbNr].CS.R;
                    data = canHw->BUF[mbNr].DATA.W[0];

                    // According to autosar MSB shuould be set if extended
                    if (hohObj->CanIdType == CAN_ID_TYPE_EXTENDED) {
                        id = canHw->BUF[mbNr].ID.R;
                        id |= 0x80000000;
                    } else {
                        id = canHw->BUF[mbNr].ID.B.STD_ID;
                    }

                    if (GET_CALLBACKS()->RxIndication != NULL) {
                        GET_CALLBACKS()->RxIndication(hohObj->CanObjectId, id,
                                canHw->BUF[mbNr].CS.B.LENGTH,
                                (uint8 *) &canHw->BUF[mbNr].DATA.W[0]);
                    }
                    // Increment statistics
                    canUnit->stats.rxSuccessCnt++;

                    // unlock MB (dummy read timer)
                    (void) canHw->TIMER.R;

                    // Clear interrupt
                    canHw->IFRL.R = (1 << mbNr);
                }
            }
        } while (!hohObj->Can_Arc_EOL);

        // Tx
        hohObj = canHwConfig->Can_Arc_Hoh;
        --hohObj;
        do {
            ++hohObj;

            if (hohObj->CanObjectType == CAN_OBJECT_TYPE_TRANSMIT) {
                mbMask = hohObj->Can_Arc_MbMask & iFlagLow;

                // Loop over the Mb's for this Hoh
                for (; mbMask; mbMask &= ~(1 << mbNr)) {
                    mbNr = ilog2(mbMask);

                    if (GET_CALLBACKS()->TxConfirmation != NULL) {
                        GET_CALLBACKS()->TxConfirmation(
                                canUnit->swPduHandles[mbNr]);
                    }
                    canUnit->swPduHandles[mbNr] = 0; // Is this really necessary ??

                    // Clear interrupt
                    canHw->IFRL.R = (1 << mbNr);
                    canUnit->mbTxFree |= (1 << mbNr);  // This box is free
                }
            }
        } while (!hohObj->Can_Arc_EOL);
    }
}

//-------------------------------------------------------------------


// This initiates ALL can controllers
void Can_Init( const Can_ConfigType *config ) {
  Can_UnitType *canUnit;
  const Can_ControllerConfigType *canHwConfig;
  uint32 ctlrId;

  VALIDATE_NO_RV( (Can_Global.initRun == CAN_UNINIT), 0x0, CAN_E_TRANSITION );
  VALIDATE_NO_RV( (config != NULL ), 0x0, CAN_E_PARAM_POINTER );

  // Save config
  Can_Global.config = config;
  Can_Global.initRun = CAN_READY;


  for (int configId=0; configId < CAN_ARC_CTRL_CONFIG_CNT; configId++) {
    canHwConfig = GET_CONTROLLER_CONFIG(configId);
    ctlrId = canHwConfig->CanControllerId;

    // Assign the configuration channel used later..
    Can_Global.channelMap[canHwConfig->CanControllerId] = configId;
    Can_Global.configured |= (1<<ctlrId);

