openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Can.c
    canUnit = GET_PRIVATE_DATA(ctlrId);
    canUnit->state = CANIF_CS_STOPPED;

    canUnit->lock_cnt = 0;

    // Clear stats
    memset(&canUnit->stats, 0, sizeof(Can_Arc_StatisticsType));

    Can_InitController(ctlrId, canHwConfig);

    // Loop through all Hoh:s and map them into the HTHMap
    const Can_HardwareObjectType* hoh;
    hoh = canHwConfig->Can_Arc_Hoh;
    hoh--;
    do
    {
      hoh++;

      if (hoh->CanObjectType == CAN_OBJECT_TYPE_TRANSMIT)
      {
        Can_Global.CanHTHMap[hoh->CanObjectId].CanControllerRef = canHwConfig->CanControllerId;
        Can_Global.CanHTHMap[hoh->CanObjectId].CanHOHRef = hoh;
        Can_Global.CanHTHMap[hoh->CanObjectId].HxHRef = hoh->CanObjectId;
      }
    } while (!hoh->Can_Arc_EOL);

    // Note!
    // Could install handlers depending on HW objects to trap more errors
    // in configuration
    switch( canHwConfig->CanControllerId ) {
#if defined(CFG_MPC5606S)
    case CAN_CTRL_A:
    	ISR_INSTALL_ISR2(  "Can", Can_A_BusOff, FLEXCAN_0_ESR_BOFF_INT,     2, 0);
    	ISR_INSTALL_ISR2(  "Can", Can_A_Err,    FLEXCAN_0_ESR_ERR_INT,      2, 0 );
    	INSTALL_HANDLER4(  "Can", Can_A_Isr,    FLEXCAN_0_BUF_00_03,        2, 0 );  /* 0-3, 4-7, 8-11, 12-15 */
    	ISR_INSTALL_ISR2(  "Can", Can_A_Isr,    FLEXCAN_0_BUF_16_31,        2, 0 );
    	ISR_INSTALL_ISR2(  "Can", Can_A_Isr,    FLEXCAN_0_BUF_32_63,        2, 0 );
    	break;
    case CAN_CTRL_B:
    	ISR_INSTALL_ISR2(  "Can", Can_B_BusOff, FLEXCAN_1_ESR_BOFF_INT,     2, 0);
    	ISR_INSTALL_ISR2(  "Can", Can_B_Err,    FLEXCAN_1_ESR_ERR_INT,      2, 0 );
    	INSTALL_HANDLER4(  "Can", Can_B_Isr,    FLEXCAN_1_BUF_00_03,        2, 0 );  /* 0-3, 4-7, 8-11, 12-15 */
    	ISR_INSTALL_ISR2(  "Can", Can_B_Isr,    FLEXCAN_1_BUF_16_31,        2, 0 );
    	ISR_INSTALL_ISR2(  "Can", Can_B_Isr,    FLEXCAN_1_BUF_32_63,        2, 0 );
    	break;
#elif defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5567)
     case CAN_CTRL_A:
     	ISR_INSTALL_ISR2(  "Can", Can_A_BusOff, FLEXCAN_A_ESR_BOFF_INT,     2, 0);
     	ISR_INSTALL_ISR2(  "Can", Can_A_Err,    FLEXCAN_A_ESR_ERR_INT,      2, 0 );
     	INSTALL_HANDLER16( "Can", Can_A_Isr,    FLEXCAN_A_IFLAG1_BUF0I,     2, 0 );
     	ISR_INSTALL_ISR2(  "Can", Can_A_Isr,    FLEXCAN_A_IFLAG1_BUF31_16I, 2, 0 );
     	break;
     case CAN_CTRL_B:
     	ISR_INSTALL_ISR2(  "Can", Can_B_BusOff, FLEXCAN_B_ESR_BOFF_INT,     2, 0 );
     	ISR_INSTALL_ISR2(  "Can", Can_B_Err,    FLEXCAN_B_ESR_ERR_INT,      2, 0 );
     	INSTALL_HANDLER16( "Can", Can_B_Isr,    FLEXCAN_B_IFLAG1_BUF0I,     2, 0 );
     	ISR_INSTALL_ISR2(  "Can", Can_B_Isr,    FLEXCAN_B_IFLAG1_BUF31_16I, 2, 0 );
     	break;
     case CAN_CTRL_C:
     	ISR_INSTALL_ISR2(  "Can", Can_C_BusOff, FLEXCAN_C_ESR_BOFF_INT,     2, 0 );
     	ISR_INSTALL_ISR2(  "Can", Can_C_Err,    FLEXCAN_C_ESR_ERR_INT,      2, 0 );
     	INSTALL_HANDLER16( "Can", Can_C_Isr,    FLEXCAN_C_IFLAG1_BUF0I,     2, 0 );
     	ISR_INSTALL_ISR2(  "Can", Can_C_Isr,    FLEXCAN_C_IFLAG1_BUF31_16I, 2, 0 );
     	break;
     case CAN_CTRL_D:
     	ISR_INSTALL_ISR2(  "Can", Can_D_BusOff, FLEXCAN_D_ESR_BOFF_INT,     2, 0 );
     	ISR_INSTALL_ISR2(  "Can", Can_D_Err,    FLEXCAN_D_ESR_ERR_INT,      2, 0 );
     	INSTALL_HANDLER16( "Can", Can_D_Isr,    FLEXCAN_D_IFLAG1_BUF0I,     2, 0 );
     	ISR_INSTALL_ISR2(  "Can", Can_D_Isr,    FLEXCAN_D_IFLAG1_BUF31_16I, 2, 0 );
     	break;
     case CAN_CTRL_E:
     	ISR_INSTALL_ISR2(  "Can", Can_E_BusOff, FLEXCAN_E_ESR_BOFF_INT,     2, 0 );
     	ISR_INSTALL_ISR2(  "Can", Can_E_Err,    FLEXCAN_E_ESR_ERR_INT,      2, 0 );
     	INSTALL_HANDLER16( "Can", Can_E_Isr,    FLEXCAN_E_IFLAG1_BUF0I,     2, 0 );
     	ISR_INSTALL_ISR2(  "Can", Can_E_Isr,    FLEXCAN_E_IFLAG1_BUF31_16I, 2, 0 );
     	break;
#endif
#if defined(CFG_MPC5516) || defined(CFG_MPC5517)
     case CAN_CTRL_F:
     	ISR_INSTALL_ISR2(  "Can", Can_F_BusOff, FLEXCAN_F_ESR_BOFF_INT,     2, 0 );
     	ISR_INSTALL_ISR2(  "Can", Can_F_Err,    FLEXCAN_F_ESR_ERR_INT,      2, 0 );
     	INSTALL_HANDLER16( "Can", Can_F_Isr,    FLEXCAN_F_IFLAG1_BUF0I,     2, 0 );
     	ISR_INSTALL_ISR2(  "Can", Can_F_Isr,    FLEXCAN_F_IFLAG1_BUF31_16I, 2, 0 );
     	break;
 #endif
     default:
         assert(0);
     }
  }
  return;
}

// Unitialize the module
void Can_DeInit()
{
  Can_UnitType *canUnit;
  const Can_ControllerConfigType *canHwConfig;
  uint32 ctlrId;

  for (int configId=0; configId < CAN_ARC_CTRL_CONFIG_CNT; configId++) {
    canHwConfig = GET_CONTROLLER_CONFIG(configId);
    ctlrId = canHwConfig->CanControllerId;

    canUnit = GET_PRIVATE_DATA(ctlrId);
    canUnit->state = CANIF_CS_UNINIT;

    Can_DisableControllerInterrupts(ctlrId);

    canUnit->lock_cnt = 0;

    // Clear stats
    memset(&canUnit->stats, 0, sizeof(Can_Arc_StatisticsType));
  }

  Can_Global.config = NULL;
  Can_Global.initRun = CAN_UNINIT;

  return;
}

void Can_InitController( uint8 controller, const Can_ControllerConfigType *config) {

  flexcan_t *canHw;
  uint8_t tq;
  uint8_t tq1;
  uint8_t tq2;
  uint32_t clock;
  int i;
  Can_UnitType *canUnit;
  uint8 cId = controller;
  const Can_ControllerConfigType *canHwConfig;
  const Can_HardwareObjectType *hohObj;

  VALIDATE_NO_RV( (Can_Global.initRun == CAN_READY), 0x2, CAN_E_UNINIT );
  VALIDATE_NO_RV( (config != NULL ), 0x2,CAN_E_PARAM_POINTER);
  VALIDATE_NO_RV( (controller < GET_CONTROLLER_CNT()), 0x2, CAN_E_PARAM_CONTROLLER );

  canUnit = GET_PRIVATE_DATA(controller);

  VALIDATE_NO_RV( (canUnit->state==CANIF_CS_STOPPED), 0x2, CAN_E_TRANSITION );

  canHw = GET_CONTROLLER(cId);
  canHwConfig = GET_CONTROLLER_CONFIG(Can_Global.channelMap[cId]);

  // Start this baby up
  canHw->MCR.B.MDIS = 0;

  // Wait for it to reset
  if( !SIMULATOR() ) {
    // Make a reset so we have a known state
    //canHw->MCR.B.SOFTRST = 1;  /* commented out for step-in debug mode */
    //while( canHw->MCR.B.SOFTRST == 1);
    // Freeze to write all mem mapped registers ( see 25.4.8.1 )
    canHw->MCR.B.FRZ = 1;
    //while( canHw->MCR.B.FRZACK == 0);
  }

#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5606S)
  // Note!
  // FIFO implemenation not tested
  if( config->Can_Arc_Fifo ) {
    canHw->MCR.B.FEN = 1;	// Enable FIFO
    canHw->MCR.B.IDAM = 0; 	// We want extended id's to match with
  }
  canHw->MCR.B.BCC = 1; // Enable all nice features
#endif
  /* Use Fsys derivate */
  canHw->CR.B.CLKSRC = 1;
  canHw->MCR.B.MAXMB = MAX_NUM_OF_MAILBOXES - 1;

