openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Can.c
  /* Disable selfreception */
  canHw->MCR.B.SRXDIS = !config->Can_Arc_Loopback;

  // Clock calucation
  // -------------------------------------------------------------------
  //
  // * 1 TQ = Sclk period( also called SCK )
  // * Ftq = Fcanclk / ( PRESDIV + 1 ) = Sclk
  //   ( Fcanclk can come from crystal or from the peripheral dividers )
  //
  // -->
  // TQ = 1/Ftq = (PRESDIV+1)/Fcanclk --> PRESDIV = (TQ * Fcanclk - 1 )
  // TQ is between 8 and 25

  // Calculate the number of timequanta's
  // From "Protocol Timing"( chap. 25.4.7.4 )
  tq1 = ( config->CanControllerPropSeg + config->CanControllerSeg1 + 2);
  tq2 = (config->CanControllerSeg2 + 1);
  tq = 1 + tq1 + tq2;

  // Check TQ limitations..
  VALIDATE_DEM_NO_RV(( (tq1>=4) && (tq1<=16)), CAN_E_TIMEOUT );
  VALIDATE_DEM_NO_RV(( (tq2>=2) && (tq2<=8)), CAN_E_TIMEOUT );
  VALIDATE_DEM_NO_RV(( (tq>8) && (tq<25 )), CAN_E_TIMEOUT );

  // Assume we're using the peripheral clock instead of the crystal.
  clock = McuE_GetPeripheralClock( (McuE_PeriperalClock_t) config->CanCpuClockRef );

  canHw->CR.B.PRESDIV = clock/(config->CanControllerBaudRate*1000*tq) - 1;
  canHw->CR.B.PROPSEG = config->CanControllerPropSeg;
  canHw->CR.B.PSEG1 = config->CanControllerSeg1;
  canHw->CR.B.PSEG2 = config->CanControllerSeg2;
  canHw->CR.B.SMP = 	1;	// 3 samples better than 1 ??
  canHw->CR.B.LPB =	config->Can_Arc_Loopback;
  canHw->CR.B.BOFFREC = 1;  // Disable bus off recovery

#if defined(CFG_MPC5606S)
  SIU.PSMI[0].R = 0x00;
  SIU.PSMI[1].R = 0x00;
#endif

#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5606S)
  // Check if we use individual masks. If so accept anything(=0) for now
  if( canHw->MCR.B.BCC ) {
    i = (config->Can_Arc_Fifo ? 8 : 0 );
    for(;i<63;i++) {
      canHw->RXIMR[i].R = 0;
    }
  }
#endif
#if defined(CFG_MPC5567)
  // Enable individual Rx ID masking and the reception queue features.
  canHw->MCR.B.MBFEN = 1;
#endif
  // Set the id's
  if( config->Can_Arc_Fifo ) {
    // Clear ID's in FIFO also, MUST set extended bit here
    uint32_t *fifoId = (uint32_t*)(((uint8_t *)canHw)+0xe0);
    for(int k=0;k<8;k++) {
      fifoId[k] = 0x40000000; 	// accept extended frames
    }
  }

  // Mark all slots as inactive( depending on fifo )
  i = (config->Can_Arc_Fifo ? 8 : 0 );
  for(; i < 63; i++) {
    //canHw->BUF[i].CS.B.CODE = 0;
    canHw->BUF[i].CS.R = 0;
    canHw->BUF[i].ID.R = 0;
  }

  {
    /* Build a global interrupt/mb mask for all Hoh's */
    uint32 mbMask;
    uint32 mbNr = 0;
    Can_FilterMaskType mask = 0xffffffff;

    // Rx
    hohObj = canHwConfig->Can_Arc_Hoh;
    --hohObj;
    do {
      ++hohObj;

      mbMask = hohObj->Can_Arc_MbMask;
      mbNr = 0;

      if (hohObj->CanObjectType == CAN_OBJECT_TYPE_RECEIVE)
      {
        for(;mbMask;mbMask&=~(1<<mbNr)) {
          mbNr = ilog2(mbMask);
          canHw->BUF[mbNr].CS.B.CODE = MB_RX;
          if ( hohObj->CanIdType == CAN_ID_TYPE_EXTENDED )
          {
            canHw->BUF[mbNr].CS.B.IDE = 1;
#if defined(CFG_MPC5567)
            canHw->RXIMR[mbNr].B.MI = *hohObj->CanFilterMaskRef;
#else
            canHw->BUF[mbNr].ID.R = *hohObj->CanFilterMaskRef; // Write 29-bit MB IDs
#endif
          }
          else
          {
            canHw->BUF[mbNr].CS.B.IDE = 0;
#if defined(CFG_MPC5567)
            canHw->RXIMR[mbNr].B.MI = *hohObj->CanFilterMaskRef;
#else
            canHw->BUF[mbNr].ID.B.STD_ID = *hohObj->CanFilterMaskRef;
#endif
         }
        }

        // Add to global mask
        canUnit->Can_Arc_RxMbMask |= hohObj->Can_Arc_MbMask;
        if( hohObj->CanFilterMaskRef != NULL  ) {
          mask &= *hohObj->CanFilterMaskRef;
        }
      }
      else
      {
        canUnit->Can_Arc_TxMbMask |= hohObj->Can_Arc_MbMask;
      }
    } while( !hohObj->Can_Arc_EOL );

#if defined(CFM_MPC5567)
#else
    // Set global mask
    canHw->RXGMASK.R = mask;
    // Don't use them
    canHw->RX14MASK.R = 0;
    canHw->RX15MASK.R = 0;
#endif
  }

  canUnit->mbTxFree = canUnit->Can_Arc_TxMbMask;

  canUnit->state = CANIF_CS_STOPPED;
  Can_EnableControllerInterrupts(cId);

  return;
}


Can_ReturnType Can_SetControllerMode( uint8 controller, Can_StateTransitionType transition ) {
  flexcan_t *canHw;
  imask_t state;
  Can_ReturnType rv = CAN_OK;
  VALIDATE( (controller < GET_CONTROLLER_CNT()), 0x3, CAN_E_PARAM_CONTROLLER );

  Can_UnitType *canUnit = GET_PRIVATE_DATA(controller);

  VALIDATE( (canUnit->state!=CANIF_CS_UNINIT), 0x3, CAN_E_UNINIT );
  canHw = GET_CONTROLLER(controller);

  switch(transition )
  {
  case CAN_T_START:
    canHw->MCR.B.FRZ = 0;
    canHw->MCR.B.HALT = 0;
    canUnit->state = CANIF_CS_STARTED;
    Irq_Save(state);
    if (canUnit->lock_cnt == 0)   // REQ CAN196
    {
      Can_EnableControllerInterrupts(controller);
    }
    Irq_Restore(state);
    break;
  case CAN_T_WAKEUP:  //CAN267
  case CAN_T_SLEEP:  //CAN258, CAN290
    // Should be reported to DEM but DET is the next best
    VALIDATE(canUnit->state == CANIF_CS_STOPPED, 0x3, CAN_E_TRANSITION);
  case CAN_T_STOP:
    // Stop
    canHw->MCR.B.FRZ = 1;
    canHw->MCR.B.HALT = 1;
    canUnit->state = CANIF_CS_STOPPED;
    Can_AbortTx( canHw, canUnit ); // CANIF282
    break;
  default:
    // Should be reported to DEM but DET is the next best
    VALIDATE(canUnit->state == CANIF_CS_STOPPED, 0x3, CAN_E_TRANSITION);
    break;
  }

  return rv;
}

void Can_DisableControllerInterrupts( uint8 controller )
{
  Can_UnitType *canUnit;
  flexcan_t *canHw;
  imask_t state;

  VALIDATE_NO_RV( (controller < GET_CONTROLLER_CNT()), 0x4, CAN_E_PARAM_CONTROLLER );

  canUnit = GET_PRIVATE_DATA(controller);

  VALIDATE_NO_RV( (canUnit->state!=CANIF_CS_UNINIT), 0x4, CAN_E_UNINIT );

  Irq_Save(state);
  if(canUnit->lock_cnt > 0 )
  {
    // Interrupts already disabled
    canUnit->lock_cnt++;
    Irq_Restore(state);
    return;
  }
  canUnit->lock_cnt++;
  Irq_Restore(state);

  /* Don't try to be intelligent, turn everything off */
  canHw = GET_CONTROLLER(controller);

  /* Turn off the interrupt mailboxes */
  canHw->IMRH.R = 0;
  canHw->IMRL.R = 0;

