openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Can.c
  /* Turn off the bus off/tx warning/rx warning and error */
  canHw->MCR.B.WRNEN = 0;  	/* Disable warning int */
  canHw->CR.B.ERRMSK = 0;  	/* Disable error interrupt */
  canHw->CR.B.BOFFMSK = 0; 	/* Disable bus-off interrupt */
  canHw->CR.B.TWRNMSK = 0;	/* Disable Tx warning */
  canHw->CR.B.RWRNMSK = 0;	/* Disable Rx warning */
}

void Can_EnableControllerInterrupts( uint8 controller ) {
  Can_UnitType *canUnit;
  flexcan_t *canHw;
  imask_t state;
  const Can_ControllerConfigType *canHwConfig;
  VALIDATE_NO_RV( (controller < GET_CONTROLLER_CNT()), 0x5, CAN_E_PARAM_CONTROLLER );

  canUnit = GET_PRIVATE_DATA(controller);

  VALIDATE_NO_RV( (canUnit->state!=CANIF_CS_UNINIT), 0x5, CAN_E_UNINIT );

  Irq_Save(state);
  if( canUnit->lock_cnt > 1 )
  {
    // IRQ should still be disabled so just decrement counter
    canUnit->lock_cnt--;
    Irq_Restore(state);
    return;
  } else if (canUnit->lock_cnt == 1)
  {
    canUnit->lock_cnt = 0;
  }
  Irq_Restore(state);

  canHw = GET_CONTROLLER(controller);

  canHwConfig = GET_CONTROLLER_CONFIG(Can_Global.channelMap[controller]);

  canHw->IMRH.R = 0;
  canHw->IMRL.R = 0;

  if( canHwConfig->CanRxProcessing == CAN_ARC_PROCESS_TYPE_INTERRUPT ) {
    /* Turn on the interrupt mailboxes */
    canHw->IMRL.R = canUnit->Can_Arc_RxMbMask;
  }

  if( canHwConfig->CanTxProcessing == CAN_ARC_PROCESS_TYPE_INTERRUPT ) {
    /* Turn on the interrupt mailboxes */
    canHw->IMRL.R |= canUnit->Can_Arc_TxMbMask;
  }

  // BusOff here represents all errors and warnings
  if( canHwConfig->CanBusOffProcessing == CAN_ARC_PROCESS_TYPE_INTERRUPT ) {
    canHw->MCR.B.WRNEN = 1;  	/* Turn On warning int */

    canHw->CR.B.ERRMSK = 1;  	/* Enable error interrupt */
    canHw->CR.B.BOFFMSK = 1; 	/* Enable bus-off interrupt */
    canHw->CR.B.TWRNMSK = 1;	/* Enable Tx warning */
    canHw->CR.B.RWRNMSK = 1;	/* Enable Rx warning */
  }

  return;
}

Can_ReturnType Can_Write( Can_Arc_HTHType hth, Can_PduType *pduInfo ) {
  uint16_t timer;
  uint32_t iflag;
  Can_ReturnType rv = CAN_OK;
  uint32_t mbNr;
  flexcan_t *canHw;
  const Can_HardwareObjectType *hohObj;
  uint32 controller;
  imask_t state;

  VALIDATE( (Can_Global.initRun == CAN_READY), 0x6, CAN_E_UNINIT );
  VALIDATE( (pduInfo != NULL), 0x6, CAN_E_PARAM_POINTER );
  VALIDATE( (pduInfo->length <= 8), 0x6, CAN_E_PARAM_DLC );
  VALIDATE( (hth < NUM_OF_HTHS ), 0x6, CAN_E_PARAM_HANDLE );

  hohObj = Can_FindHoh(hth, &controller);
  if (hohObj == NULL)
    return CAN_NOT_OK;

  Can_UnitType *canUnit = GET_PRIVATE_DATA(controller);

  canHw = GET_CONTROLLER(controller);
  Irq_Save(state);

  /* We must be able to send from interrupt context
   * (ie. Can_Isr() call Can_Write(), Can_Write )
   */

  iflag = canUnit->Can_Arc_TxMbMask & (~canHw->IFRL.R) & canUnit->mbTxFree;
  if( iflag  ) {

      /* MbMask Iflag Start
       *   0      0     -> 0
       *   0      1     -> 0
       *   1      0     -> 1
       *   1      1     -> 0  (Waiting for Tx conf)
       */

      mbNr = ilog2( iflag ); // find mb number

      canUnit->mbTxFree &= ~(1<<mbNr);    // Indicate that we are sending this MB
      // Setup message box type
      if( hohObj->CanIdType == CAN_ID_TYPE_EXTENDED ) {
        canHw->BUF[mbNr].CS.B.IDE = 1;
      } else if ( hohObj->CanIdType == CAN_ID_TYPE_STANDARD ) {
        canHw->BUF[mbNr].CS.B.IDE = 0;
      } else {
        // No support for mixed in this processor
        assert(0);
      }

      // Send on buf
      canHw->BUF[mbNr].CS.B.CODE = MB_INACTIVE;   // Hold the transmit buffer inactive
      if( hohObj->CanIdType == CAN_ID_TYPE_EXTENDED ) {
        canHw->BUF[mbNr].ID.R = pduInfo->id; // Write 29-bit MB IDs
      } else {
        assert( !(pduInfo->id & 0xfffff800) );
        canHw->BUF[mbNr].ID.B.STD_ID = pduInfo->id;
      }

  #if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5606S)
      canHw->BUF[mbNr].ID.B.PRIO = 1;             // Set Local Priority
  #endif

      memset(&canHw->BUF[mbNr].DATA, 0, 8);
      memcpy(&canHw->BUF[mbNr].DATA, pduInfo->sdu, pduInfo->length);

      canHw->BUF[mbNr].CS.B.SRR = 1;
      canHw->BUF[mbNr].CS.B.RTR = 0;

      canHw->BUF[mbNr].CS.B.LENGTH = pduInfo->length;
      canHw->BUF[mbNr].CS.B.CODE = MB_TX_ONCE;            // Write tx once code
      timer = canHw->TIMER.R;                         // Unlock Message buffers

      canUnit->stats.txSuccessCnt++;

      // Store pdu handle in unit to be used by TxConfirmation
      canUnit->swPduHandles[mbNr] = pduInfo->swPduHandle;
  } else {
      rv = CAN_BUSY;
  }
  Irq_Restore(state);

  return rv;
}

void Can_MainFunction_Read( void ) {

	/* NOT SUPPORTED */
}

void Can_MainFunction_BusOff( void ) {
  /* Bus-off polling events */

	/* NOT SUPPORTED */
}

void Can_MainFunction_Wakeup( void ) {
  /* Wakeup polling events */

	/* NOT SUPPORTED */
}


/**
 * Get send/receive/error statistics for a controller
 *
 * @param controller The controller
 * @param stats Pointer to data to copy statistics to
 */

void Can_Arc_GetStatistics( uint8 controller, Can_Arc_StatisticsType *stats)
{
  Can_UnitType *canUnit = GET_PRIVATE_DATA(controller);
  *stats = canUnit->stats;
}



